app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ('Hello my 2nd blog post ever', 'Hi hi this is my second article ever I hope you like it. It should be more than 10 characters this time', '2024-12-16 05:58:29.120999', '2024-12-16 05:58:29.120999') RETURNING "id"
---
  def create
    @article = Article.new(title: "...", body: "...")

    if @article.save